Adds sphinx to project
