--- a/README.md
+++ b/README.md
@@ -54,54 +52,56 @@ Integration tests are expected for every program flow.
 ### Functional Requirements
 
-Functional requirements are phrased as use cases and can be found in [docs/use_cases](docs/use_cases).
-```plantuml
-@startuml
-!theme crt-amber
-left to right direction
-actor Client as client
-actor Time as time
-package Generation {
-  usecase "Get Montesinos job" as G1
-  usecase "Report Montesinos job" as G2
-}
-package "Job Handling" {
-  usecase "Build job" as JH1
+```mermaid
 
-  usecase "Clean up stale jobs" as JH2
-  usecase "Clean up complete jobs" as JH3
-  usecase "Fill job queue" as JH7
+flowchart LR
+    subgraph 'Generation'
+        direction LR
+        G1([Get Montesinos job])
+        G2([Report Montesinos job])
+    end
+    subgraph 'Job Handling'
+        direction LR
+        JH1([Build job])
+        JH2([Clean up stale jobs   ])
+        JH3([Clean up complete jobs])
+        JH4([Mark job as complete  ])
+        JH5([Mark job as new       ])
+        JH6([Mark job as pending   ])
+        JH7([Fill job queue        ])
+    end
+    subgraph 'Database Handling'
+        direction LR
+        DH1([Mark progress   ])
+        DH2([Write record set])
+        DH3([Read record set ])
+    end
 
-  usecase "Mark job as new" as JH5
-  usecase "Mark job as pending " as JH6
-  usecase "Mark job as complete" as JH4
-
-}
-package "Database Handling" {
-  usecase "Mark progress" as DH1
-  usecase "Write record set" as DH2
-  usecase "Read record set" as DH3
-}
-
-client --> G1
-client --> G2
-time --> JH2
-time --> JH3
-time --> JH7
-
-JH7 --> JH1 #line.dotted : <<include>>
-JH1 --> DH3 #line.dotted : <<include>>
-JH1 --> JH5 #line.dotted : <<include>>
-JH2 --> JH6 #line.dotted : <<include>>
-JH3 --> DH1 #line.dotted : <<include>>
-JH3 --> DH2 #line.dotted : <<include>>
-G1  --> JH6 #line.dotted : <<include>>
-G2  --> JH4 #line.dotted : <<include>>
+    client["Client fa-user-o"]
+    time["Client fa-user-o"]
 
 
-@enduml
+    client --> G1
+    client --> G2
+    time --> JH2
+    time --> JH3
+    time --> JH7
 
+    JH1 -. include .-> JH5
+    JH2 -. include .-> JH6
+    JH7 -. include .-> JH1
+    JH1 -. include .-> DH3
+    JH3 -. include .-> DH1
+    JH3 -. include .-> DH2
+    G1  -. include .-> JH6
+    G2  -. include .-> JH4
 
+```
+Functional requirements are phrased in the following use cases
+
+```{toctree}
+:maxdepth: 1
+use_cases/index.md
 ```
 
 ### Non-functional Requirements
